import argparse
import sys
import time
import os
from colorama import init, Fore, Style
import pyfiglet

init()

def print_banner():
    os.system('clear' if os.name == 'posix' else 'cls')
    
    banner = """
██╗   ██╗███████╗██╗     ██╗      ██████╗ ██╗    ██╗
╚██╗ ██╔╝██╔════╝██║     ██║     ██╔═══██╗██║    ██║
 ╚████╔╝ █████╗  ██║     ██║     ██║   ██║██║ █╗ ██║
  ╚██╔╝  ██╔══╝  ██║     ██║     ██║   ██║██║███╗██║
   ██║   ███████╗███████╗███████╗╚██████╔╝╚███╔███╔╝
   ╚═╝   ╚══════╝╚══════╝╚══════╝ ╚═════╝  ╚══╝╚══╝ 
                                                   
     █████╗  ██████╗ ███████╗███╗   ██╗████████╗
    ██╔══██╗██╔════╝ ██╔════╝████╗  ██║╚══██╔══╝
    ███████║██║  ███╗█████╗  ██╔██╗ ██║   ██║   
    ██╔══██║██║   ██║██╔══╝  ██║╚██╗██║   ██║   
    ██║  ██║╚██████╔╝███████╗██║ ╚████║   ██║   
    ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═╝  ╚═══╝   ╚═╝   
"""
    
    print(Fore.CYAN + banner + Style.RESET_ALL)
    print(Fore.GREEN + "\t\t\t\t\tffoster007" + Style.RESET_ALL)
    print()
    print(Fore.MAGENTA + "Yellow Agent" + Style.RESET_ALL)
    print()
    print(Fore.MAGENTA + "\tOpen Source (R.C.S) Cybersecurity Software for Manage your own environment" + Style.RESET_ALL)